Revit 2026 API

# SystemZoneData Properties

---

The SystemZoneData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from GenericZoneDomainData) |
|  | ZoneEquipmentId | The id of the zone equipment related to the zone. |

#### Reference

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace